tests/performance/load-testing.yml
# Artillery Load Testing Configuration
# Run: artillery run tests/performance/load-testing.yml

config:
  target: "http://localhost:3000"
  phases:
    # Warm up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    
    # Ramp up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up load"
    
    # Sustained load
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    
    # Peak load
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
    
    # Cool down
    - duration: 60
      arrivalRate: 20
      name: "Cool down"
  
  processor: "./tests/performance/processor.js"
  
  # Performance thresholds
  ensure:
    maxErrorRate: 1
    p99: 2000  # 99th percentile < 2000ms
    p95: 1000  # 95th percentile < 1000ms
    
scenarios:
  # Health check scenario
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

  # Authentication scenario
  - name: "User Login"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@test.com"
            password: "TestAdmin123!"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200

  # Gallery access scenario
  - name: "Guest Gallery Access"
    weight: 30
    flow:
      - post:
          url: "/api/gallery/test-wedding-2024/access"
          json:
            accessCode: "TEST123"
            guestName: "Load Test Guest"
          capture:
            - json: "$.token"
              as: "guestToken"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/gallery/test-wedding-2024/photos"
          headers:
            Authorization: "Bearer {{ guestToken }}"
          expect:
            - statusCode: 200

  # Photo viewing scenario
  - name: "Photo Operations"
    weight: 40
    flow:
      # Access gallery
      - post:
          url: "/api/gallery/test-wedding-2024/access"
          json:
            accessCode: "TEST123"
            guestName: "Photo Viewer"
          capture:
            - json: "$.token"
              as: "guestToken"
      
      # Get photos
      - get:
          url: "/api/gallery/test-wedding-2024/photos"
          headers:
            Authorization: "Bearer {{ guestToken }}"
          capture:
            - json: "$.photos[0].id"
              as: "photoId"
      
      # Like photo
      - post:
          url: "/api/gallery/test-wedding-2024/photos/{{ photoId }}/like"
          headers:
            Authorization: "Bearer {{ guestToken }}"
      
      # View photo
      - think: 2  # Simulate viewing time
      
      # Download photo
      - get:
          url: "/api/gallery/test-wedding-2024/photos/{{ photoId }}/download"
          headers:
            Authorization: "Bearer {{ guestToken }}"

  # Admin operations scenario
  - name: "Admin Dashboard"
    weight: 15
    flow:
      # Login as admin
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@test.com"
            password: "TestAdmin123!"
          capture:
            - json: "$.token"
              as: "adminToken"
      
      # Get events
      - get:
          url: "/api/admin/events"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: 200
      
      # Get dashboard stats
      - get:
          url: "/api/admin/dashboard"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: 200